# SplitElementDeletionWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericMEPFailures..::..SplitElementDeletionWarning Property
BuiltInFailures..::..GenericMEPFailures Class See Also
---
The value specified for the Joint Gap exceeds the length of the split segment, so the segment will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SplitElementDeletionWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SplitElementDeletionWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SplitElementDeletionWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GenericMEPFailures Class
Autodesk.Revit.DB Namespace